# SteelElemWeldDoubleWeldprep Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemWeldDoubleWeldprep Property
ParameterTypeId Class See Also
---
"Double Weld preparation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemWeldDoubleWeldprep { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemWeldDoubleWeldprep As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemWeldDoubleWeldprep {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace